verticon/Nordic/nRF51_SDK_10.0.0_dc26b5e/projects/peripherals/general_purpose_data/main.c
/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code;

    switch (p_ble_evt->header.evt_id)
            {
        case BLE_GAP_EVT_CONNECTED:
            err_code = bsp_indication_set(BSP_INDICATE_CONNECTED);
            APP_ERROR_CHECK(err_code);
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
            break;

        case BLE_GAP_EVT_DISCONNECTED:
            m_conn_handle = BLE_CONN_HANDLE_INVALID;
            break;

        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for dispatching a BLE stack event to all modules with a BLE stack event handler.
 *
 * @details This function is called from the BLE Stack event interrupt handler after a BLE stack
 *          event has been received.
 *
 * @param[in] p_ble_evt  Bluetooth stack event.
 */
static void ble_evt_dispatch(ble_evt_t * p_ble_evt)
{
	#ifdef SEGGER_LOGGING
    char description[1000];
    SEGGER_RTT_printf(0, "BLE event received: %s\n", DescribeBleEvent(p_ble_evt, description));
	#endif

    dm_ble_evt_handler(p_ble_evt);
    ble_conn_params_on_ble_evt(p_ble_evt);
    bsp_btn_ble_on_ble_evt(p_ble_evt);
    on_ble_evt(p_ble_evt);
    ble_advertising_on_ble_evt(p_ble_evt);
    /*YOUR_JOB add calls to _on_ble_evt functions from each service your application is using
    ble_xxs_on_ble_evt(&m_xxs, p_ble_evt);
    ble_yys_on_ble_evt(&m_yys, p_ble_evt);
    */
    (*pDataService->bleEventHandler)(pDataService, p_ble_evt);
}


/**@brief Function for dispatching a system event to interested modules.
 *
 * @details This function is called from the System event interrupt handler after a system
 *          event has been received.
 *
 * @param[in] sys_evt  System stack event.
 */
static void sys_evt_dispatch(uint32_t sys_evt)
{
    pstorage_sys_event_handler(sys_evt);
    ble_advertising_on_sys_evt(sys_evt);
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    uint32_t err_code;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_INIT(NRF_CLOCK_LFCLKSRC_XTAL_20_PPM, NULL);

#if defined(S110) || defined(S130) || defined(S132)
    // Enable BLE stack.
    ble_enable_params_t ble_enable_params;
    memset(&ble_enable_params, 0, sizeof(ble_enable_params));
#if (defined(S130) || defined(S132))
    ble_enable_params.gatts_enable_params.attr_tab_size   = BLE_GATTS_ATTR_TAB_SIZE_DEFAULT;
#endif
    ble_enable_params.gatts_enable_params.service_changed = IS_SRVC_CHANGED_CHARACT_PRESENT;
    err_code = sd_ble_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);
#endif

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */
void bsp_event_handler(bsp_event_t event)
{
	#ifdef SEGGER_LOGGING
	SEGGER_RTT_printf(0, "A BSP event was received; value = %d\n", event);
	#endif

	uint32_t err_code;
    switch (event)
    {
        case BSP_EVENT_SLEEP:
			#ifdef SEGGER_LOGGING
			SEGGER_RTT_WriteString(0, "Sleeping\n");
			#endif
            sleep_mode_enter();
            break;

        case BSP_EVENT_DISCONNECT:
			#ifdef SEGGER_LOGGING
            SEGGER_RTT_WriteString(0, "Disconnectting\n");
			#endif
            err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_WHITELIST_OFF:
			#ifdef SEGGER_LOGGING
            SEGGER_RTT_WriteString(0, "Turning whitelist off\n");
			#endif
            err_code = ble_advertising_restart_without_whitelist();
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        case BSP_EVENT_KEY_0:
			#ifdef SEGGER_LOGGING
			SEGGER_RTT_WriteString(0, "Button 0 was pressed\n");
			#endif
			if (pDataService != NULL && pDataService->buttonHandler != NULL) (*pDataService->buttonHandler)(pDataService, BSP_BUTTON_0);
			break;

        case BSP_EVENT_KEY_1:
			#ifdef SEGGER_LOGGING
			SEGGER_RTT_WriteString(0, "Button 1 was pressed\n"); 
			#endif
			if (pDataService != NULL && pDataService->buttonHandler != NULL) (*pDataService->buttonHandler)(pDataService, BSP_BUTTON_1);
		break;

		case BSP_EVENT_KEY_2:
			#ifdef SEGGER_LOGGING
			SEGGER_RTT_WriteString(0, "Button 2 was pressed\n"); 
			#endif
			if (pDataService != NULL && pDataService->buttonHandler != NULL) (*pDataService->buttonHandler)(pDataService, BSP_BUTTON_2);
			break;

        case BSP_EVENT_KEY_3:
			#ifdef SEGGER_LOGGING
			SEGGER_RTT_WriteString(0, "Button 3 was pressed\n"); 
			#endif
			if (pDataService != NULL && pDataService->buttonHandler != NULL) (*pDataService->buttonHandler)(pDataService, BSP_BUTTON_3);
			break;

        default:
			#ifdef SEGGER_LOGGING
			SEGGER_RTT_WriteString(0, "Unrecognized BSP event");
			#endif
			break;
    }
}


/**@brief Function for handling the Device Manager events.
 *
 * @param[in] p_evt  Data associated to the device manager event.
 */
static uint32_t device_manager_evt_handler(dm_handle_t const * p_handle, dm_event_t const * p_event, ret_code_t event_result)
{
    APP_ERROR_CHECK(event_result);

#ifdef BLE_DFU_APP_SUPPORT
    if (p_event->event_id == DM_EVT_LINK_SECURED)
    {
        app_context_load(p_handle);
    }
#endif // BLE_DFU_APP_SUPPORT

    return NRF_SUCCESS;
}


/**@brief Function for the Device Manager initialization.
 *
 * @param[in] erase_bonds  Indicates whether bonding information should be cleared from
 *                         persistent storage during initialization of the Device Manager.
 */
static void device_manager_init(bool erase_bonds)
{
    uint32_t               err_code;
    dm_init_param_t        init_param = {.clear_persistent_data = erase_bonds};
    dm_application_param_t register_param;

    // Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

