verticon/Nordic/nRF51_SDK_10.0.0_dc26b5e/projects/peripherals/general_purpose_data/main.c
    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t      err_code;

    // Build advertising data struct to pass into @ref ble_advertising_init.
    ble_advdata_t advdata;
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance      = true;
    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    advdata.uuids_complete.p_uuids  = m_adv_uuids;

	// Scan response data
	ble_advdata_t srdata;
	memset(&srdata, 0, sizeof(srdata));
	ble_uuid_t srv_uuids[] = { {SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN} };
	srdata.uuids_complete.uuid_cnt = sizeof(srv_uuids) / sizeof(srv_uuids[0]);
	srdata.uuids_complete.p_uuids = srv_uuids;

    ble_adv_modes_config_t options = {0};
    options.ble_adv_fast_enabled  = BLE_ADV_FAST_ENABLED;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &srdata, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LED | BSP_INIT_BUTTONS,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER), 
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}

void uart_error_handler(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}

#ifdef	PRESENT_MENU

void put(char* buffer)
{
	#ifdef	SEGGER_USER_IO

		SEGGER_RTT_WriteString(0, buffer);

	#else

		fputs(buffer, stdout);

	#endif
}

void get(char* buffer, int size)
{
	memset(buffer, 0, size);

	#ifdef	SEGGER_USER_IO

		char key;
        do {
            *buffer++ = key = SEGGER_RTT_WaitKey();
	    } while (key != '\r' && key != '\n');

	#else

        // The documentation states that gets has been deprecated due to security concerns
        // and that fgets should be used instead. However, fgets behaves oddly: it copies
        // less than the characters up to and including the newline to the buffer.
		//fgets(buffer, sizeof(size), stdin);
		//buffer[strlen(buffer) - 1] = 0; // Remove the new line
		gets(buffer);

	#endif
}

void presentMenu(Characteristic_t* characteristics, uint16_t count)
{
    while (true)
    {
		char buffer[100];

		// Present the menu
		put("\n\rData Update Menu\n");
		for(int i = 0; i < count; ++i)
		{
			sprintf(buffer, "    %d) %s\n", i + 1, characteristics[i].name);
			put(buffer);
		}
		put("\nSelection: ");
		
		// Get the user's selection
		uint8_t selection = 0;
		get(buffer, sizeof(buffer));
		if (sscanf(buffer, "%hhd", &selection) != 1 || selection < 1 || selection > count)
		{
            char errMessage[100];
            sprintf(errMessage, "Invalid selection: %s", buffer);
			put(errMessage);
			continue;
		}
		Characteristic_t* pCharacteristic = &characteristics[selection - 1];

		// Display the current value of the selected characteristic
		uint8_t data[200];
		memset(data, 0, sizeof(data));
		ble_gatts_value_t value;
		value.p_value = data;
		value.len = sizeof(data);
		value.offset = 0;
		uint32_t status = sd_ble_gatts_value_get(pDataService->connectionHandle, pCharacteristic->handles->value_handle, &value);
		if (status != NRF_SUCCESS)
		{
			sprintf(buffer, "Cannot get the %s characteristic's value; status = %lu\n", pCharacteristic->name, status);
			put(buffer);
			continue;
		}

		char format[100];
		sprintf(format, "The current value of the %s characteristic is %s\n", pCharacteristic->name, pCharacteristic->format);
		switch (pCharacteristic->uuid)
		{
			case BYTE_CHARACTERISTIC_UUID:
				sprintf(buffer, format, *((uint8_t*)data));
				break;
			case SHORT_CHARACTERISTIC_UUID:
				sprintf(buffer, format, *((uint16_t*)data));
				break;
			case INT_CHARACTERISTIC_UUID:
				sprintf(buffer, format, *((uint32_t*)data));
				break;
			case LONG_CHARACTERISTIC_UUID:
				sprintf(buffer, format, *((uint64_t*)data));
				break;
			case FLOAT_CHARACTERISTIC_UUID:
				sprintf(buffer, format, *((float*)data));
				break;
			case DOUBLE_CHARACTERISTIC_UUID:
				sprintf(buffer, format, *((double*)data));
				break;
			case STRING_CHARACTERISTIC_UUID:
				sprintf(buffer, format, data);
				break;
			default:
				strcpy(buffer, "Unrecognized characteristic");
		}
		put(buffer);

		// Get a new value for the selected characteristic
		put("Provide a new value (or just press return to skip): ");
		get(buffer, sizeof(buffer));
		if (strlen(buffer) > 0) (*pDataService->updateHandler)(pDataService, pCharacteristic, buffer);
	}
}

#endif

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "Initializing:\n");
	#endif

	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "    Timers\n");
	#endif
    timers_init();

	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "    Buttons & Leds\n");
	#endif
    buttons_leds_init(&erase_bonds);

	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "    BLE stack\n");
	#endif
    ble_stack_init();

	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "    Device manager\n");
	#endif
    device_manager_init(erase_bonds);
	
	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "    GAP params\n");
	#endif
    gap_params_init();

	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "    Services\n");
	#endif

	Characteristic_t characteristics[] =
	{
		{ BYTE_CHARACTERISTIC_UUID, "Byte", "%hhu", sizeof(uint8_t), malloc(sizeof(ble_gatts_char_handles_t)), false },
		{ SHORT_CHARACTERISTIC_UUID, "Short", "%hu", sizeof(uint16_t), malloc(sizeof(ble_gatts_char_handles_t)), false },
		{ INT_CHARACTERISTIC_UUID, "Int", "%u", sizeof(uint32_t), malloc(sizeof(ble_gatts_char_handles_t)), false },
		{ LONG_CHARACTERISTIC_UUID, "Long", "%llu", sizeof(uint64_t), malloc(sizeof(ble_gatts_char_handles_t)), false },
		{ FLOAT_CHARACTERISTIC_UUID, "Float", "%f", sizeof(float), malloc(sizeof(ble_gatts_char_handles_t)), false },
		{ DOUBLE_CHARACTERISTIC_UUID, "Double", "%lf", sizeof(double), malloc(sizeof(ble_gatts_char_handles_t)), false },
		{ STRING_CHARACTERISTIC_UUID, "String", "%s", MAX_STRING_LENGTH, malloc(sizeof(ble_gatts_char_handles_t)), false }
	};
	int count = sizeof(characteristics)/sizeof(characteristics[0]);
    pDataService = createDataService(characteristics, count);

	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "    Advertising\n");
	#endif
    advertising_init();

	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "    Conn params\n");
	#endif
    conn_params_init();


    // Start execution.
	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "\nStarting timers\n");
	#endif
    application_timers_start();
	#ifdef SEGGER_LOGGING
	SEGGER_RTT_WriteString(0, "Starting BLE advertising\n");
	#endif
	err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

	#ifdef PRESENT_MENU

	#ifndef SEGGER_USER_IO

    const app_uart_comm_params_t comm_params = { RX_PIN_NUMBER, TX_PIN_NUMBER, RTS_PIN_NUMBER, CTS_PIN_NUMBER, APP_UART_FLOW_CONTROL_ENABLED, false, UART_BAUDRATE_BAUDRATE_Baud38400 };
    APP_UART_FIFO_INIT(&comm_params, UART_RX_BUF_SIZE, UART_TX_BUF_SIZE, uart_error_handler, APP_IRQ_PRIORITY_LOW, err_code);
    APP_ERROR_CHECK(err_code);

	#endif

	presentMenu(characteristics, count);

	#else

	if(SEGGER_RTT_WaitKey() == 'r')
	{
		sd_nvic_SystemReset();
	}

	#endif
}

